import React from "react";

// Designs
import "./rules.scss";

const Rules = () => {
  return (
    <div className="rules-wrapper">
      <p className="rules-initiate-note">
        شما با مشاهده و یا استفاده از هر یک از خدمات تایپ‌کافه، در جایگاه یک
        کاربر عادی یا یک کاربر عضو شده، قوانین تایپ‌کافه را به رسمیت می‌شناسید.
        همچنین متعهد می‌شوید که از آخرین به‌روزرسانی این قوانین آگاهی داشته
        باشید. منظور از اسامی تایپ‌کافه و TypeCafe، وب‌سایت{" "}
        <span className="typecafe-url">https://typecafe.ir</span> می‌باشد و
        تمامی حقوق برای تایپ‌کافه محفوظ است.
      </p>
      <p className="rules-title">توزیع و انتشار محتوا</p>
      <p className="rules-value">
        تایپ‌کافه تحت قوانین جمهوری اسلامی ایران فعالیت می‌کند و هدف تایپ‌کافه
        تسهیل خدمات تایپ به صورت آنلاین و دورکاری می‌باشد. در نتیجه انتشار و
        توزیع هرگونه محتوای مجرمانه از نظر قوانین جمهوری اسلامی ایران و یا مغایر
        با اهداف اساسی سایت، خلاف قوانین است و به‌محض آگاهی یافتن از انتشار چنین
        محتوایی، حساب کاربری مجرم برای همیشه بسته خواهد شد و وجوه دریافتی نیز به
        وی بازگردانده نخواهد شد. از نمونه های اینگونه محتوا می‌توان به موارد زیر
        اشاره کرد:
      </p>
      <p className="rules-value less-mt">
        <ul style={{ marginRight: "40px" }}>
          <li>نام نمایشی نامناسب</li>
          <li>توهین، تهدید و یا بی‌احترامی به هر شکل</li>
          <li>انتشار هرگونه فایل ویروسی و مخرب</li>
          <li>انتشار محتوا و تصاویر غیراخلاقی و جنسی</li>
          <li>تبلیغ و یا ترویج هرچیزی</li>
          <li>
            تبادل راه های ارتباطی خارج از سایت از قبیل ایمیل یا شماره تلفن
          </li>
          <li>...</li>
        </ul>
      </p>
      <p className="rules-title">روند ایجاد و انجام پروژه</p>
      <p className="rules-value"></p>
      <p className="rules-title">مسئولیت محافظت از رمز عبور</p>
      <p className="rules-value"></p>
    </div>
  );
};

export default Rules;
