import React from "react";

// Components
import Accordion from "components/accordion/Accordion";

const Faq = () => {
  return (
    <div className="faq-wrapper">
      <Accordion
        q={"تایپ کافه چیه؟"}
        a={
          "تایپ‌کافه بستری است برای ایجاد و انجام پروژه‌های تایپ، به صورت دورکاری و آنلاین."
        }
      />
      <Accordion
        q={"تایپ کافه چجوری کار میکنه؟"}
        a={
          "شخصی که پروژه ای داره که باید تایپ بشه (کارفرما)، محتوی پروژه رو (عکس، فایل صوتی، فایل PDF و ...) بعد از فشرده سازی روی وبسایت آپلود می‌کنه و تایپیست ها برای انجام اون پروژه قیمت پیشنهادی خودشون رو ارسال می‌کنند. کارفرما درخواست تایپیست مورد نظر خود رو تایید می‌کنه و تایپیست بعد از تایید شدن درخواستش، باید پروژه رو تا قبل از به اتمام رسیدن مهلت تحویل، تایپ و روی وبسایت آپلود کنه."
        }
      />
      <Accordion
        q={
          "چه تضمینی وجود داره که تایپیست پروژه رو انجام بده و سر وقت تحویل بده؟"
        }
        a={
          "۱۰۰٪ جمع مبلغ پروژه توسط هر دو طرف تایپیست و کارفرما به عنوان ضمانت انجام کار قبل از به اتمام رسیدن مهلت تحویل و ضمانت پرداخت دستمزد، بلافاصله بعد از تایید پروژه توسط کارفرما، از اعتبار هر دو طرف کسر میشه و توی حساب سایت بلوکه میشه. در صورت کوتاهی هر کدام از طرفین، ٪۱۰۰ هزینه انجام پروژه به طرف دیگه انتقال داده خواهد شد."
        }
      />
      <Accordion
        q={"مبلغ ضمانت انجام پروژه و ضمانت پرداخت دستمزد چقدره و چرا؟"}
        a={"مبلغ ضمانت در هر دو حالت، ۱۰۰٪ هزینه ی انجام پروژه می‌باشد."}
      />
    </div>
  );
};

export default Faq;
